[
{"title": "IT Assistant at Bridge Talent Management", "job_link": "/job/it-assistant-bridge-talent-1"},
{"title": null, "job_link": null},
{"title": "Manager - ICT - 1 Post at Kenya Utalii College", "job_link": "/job/manager-ict-1-post-kenya-utalii-college"},
{"title": "Information Systems Auditor at GA Insurance", "job_link": "/job/information-systems-auditor-ga-insurance-1"},
{"title": "Language Annotator/Translators at Digital Divide Data (DDD Kenya)", "job_link": "/job/language-annotator-translators-digital-divide-data-ddd-kenya"},
{"title": "Information System Auditor at Workforce Africa", "job_link": "/job/information-system-auditor-workforce-africa-1"},
{"title": null, "job_link": null},
{"title": "Python & Django Developer at Corporate Staffing", "job_link": "/job/python-django-developer-corporate-staffing"},
{"title": "Information Technology Officer at a Reputable Company", "job_link": "/job/information-technology-officer-9"},
{"title": "Senior Engineering Manager at Microsoft", "job_link": "/job/senior-engineering-manager-microsoft-1"},
{"title": "Senior Cloud Architect at NCBA Group", "job_link": "/job/senior-cloud-architect-ncba-group"},
{"title": null, "job_link": null},
{"title": "Head, IT Infrastructure at NCBA Group", "job_link": "/job/head-it-infrastructure-ncba-group"},
{"title": "Volunteer: Partnership Proposal Presentation at Catchafire", "job_link": "/job/volunteer-partnership-proposal-presentation-catchafire"},
{"title": "Software Developer at BURN", "job_link": "/job/software-developer-burn-2"},
{"title": "Continual Service Improvement Analyst at M-Gas", "job_link": "/job/continual-service-improvement-analyst-m-gas"},
{"title": null, "job_link": null},
{"title": "Software Engineer - Ubuntu Core at Canonical", "job_link": "/job/software-engineer-ubuntu-core-canonical-5"},
{"title": "QSSK-ATAT-VAS-Value Added Services Manager at Q-Sourcing Servtec Group", "job_link": "/job/qssk-atat-vas-value-added-services-manager-q-sourcing-servtec-group"},
{"title": "IT Systems Support Analyst – Information & Technology Department at Bowmans (Law Firm)", "job_link": "/job/it-systems-support-analyst-information-technology-department-bowmans-law-firm-1"},
{"title": "Product Manager - Financial Services at Kyosk Digital Services", "job_link": "/job/product-manager-financial-services-kyosk-digital-services"},
{"title": null, "job_link": null},
{"title": "Digital Channels - Head at KCB Bank Kenya", "job_link": "/job/digital-channels-head-kcb-bank-kenya"},
{"title": "Performance Management & Service Delivery Transformation Officer - 3 Posts at Public Service Commission Kenya (PSCK)", "job_link": "/job/performance-management-service-delivery-transformation-officer-3-posts-public-service-commission-kenya-psck"},
{"title": null, "job_link": null},
{"title": "Volunteer: Website Major Update at Catchafire", "job_link": "/job/volunteer-website-major-update-catchafire"},
{"title": "Full Stack Developer at Nation Media Group", "job_link": "/job/full-stack-developer-nation-media-group"},
{"title": "UI/UX Designer at Nation Media Group", "job_link": "/job/ui-ux-designer-nation-media-group"},
{"title": "Engineer- RAN Evolution Planning & Deployment at Safaricom Kenya", "job_link": "/job/engineer-ran-evolution-planning-deployment-safaricom-kenya"},
{"title": null, "job_link": null},
{"title": "Microservice Developer at Safaricom Kenya", "job_link": "/job/microservice-developer-safaricom-kenya-2"},
{"title": "Tech Lead - API & Microservices at Safaricom Kenya", "job_link": "/job/tech-lead-api-microservices-safaricom-kenya"},
{"title": "Python Engineer at Canonical", "job_link": "/job/python-engineer-canonical-1"},
{"title": "Senior UX Designer - Ubuntu desktop at Canonical", "job_link": "/job/senior-ux-designer-ubuntu-desktop-canonical-4"},
{"title": null, "job_link": null},
{"title": "Containerization & Virtualisation Engineer at Canonical", "job_link": "/job/containerization-virtualisation-engineer-canonical-1"},
{"title": "Software Engineer - SaaS (launchpad.net) at Canonical", "job_link": "/job/software-engineer-saas-launchpad-net-canonical-3"},
{"title": "Software Engineering Manager - SaaS (launchpad.net) at Canonical", "job_link": "/job/software-engineering-manager-saas-launchpad-net-canonical-2"},
{"title": "Software Engineer - Identity Management for Canonical Products at Canonical", "job_link": "/job/software-engineer-identity-management-for-canonical-products-canonical-9"},
{"title": null, "job_link": null},
{"title": "Software Engineer - App Stores Backend (Remote) at Canonical", "job_link": "/job/software-engineer-app-stores-backend-remote-canonical-3"},
{"title": "Software Engineering Director at Canonical", "job_link": "/job/software-engineering-director-canonical-1"},
{"title": "Cloud Field Engineer - EMEA (Remote) at Canonical", "job_link": "/job/cloud-field-engineer-emea-remote-canonical-1"},
{"title": "Software Engineer, Telemetry at Canonical", "job_link": "/job/software-engineer-telemetry-canonical-3"},
{"title": null, "job_link": null},
{"title": "Engineering Manager, App Stores Backend at Canonical", "job_link": "/job/engineering-manager-app-stores-backend-canonical-4"},
{"job_title": "Python & Django Developer", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "1 year", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Design, develop, and maintain Django-based web applications Collaborate with cross-functional teams to identify and prioritize requirements and develop solutions to meet those requirements Write clean, maintainable, and efficient code Knowledge of asynchronous requests, partial page updates, web sockets, and server-side events Ensure the application is optimized for performance, scalability, and security Test and debug code to ensure high-quality software releases Participate in code reviews and provide feedback to other team members Stay up-to-date with the latest Django framework updates and advancements Proficient in the core principles of computer science At least 1 year of experience with Django framework and related technologies Strong knowledge of Python and related technologies Experience with Git and version control practices Strong analytical and problem-solving skills Excellent written and verbal communication skills Ability to work independently as well as in a team environment Experience with code versioning tools, such as Git Experience with Agile methodologies is a plus Knowledge of programming Point of Sales (POS) is a plus"},
{"job_title": "Software Developer", "date_posted": " Oct 23, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Collaborate with cross-functional teams to comprehend project requirements and transform them into well-designed, functional software solutions. Create, develop, test, and maintain software applications, prioritizing robustness, scalability, and performance. Write clean, efficient code following coding standards and best practices. Efficiently troubleshoot and resolve software issues, identify root causes, and implement solutions promptly. Engage in code reviews to ensure code quality, consistency, and alignment with architectural guidelines. Stay current with industry trends, emerging technologies, and best practices to enhance the development process and propose innovative ideas. Contribute to documenting software design, architecture, and development procedures. Actively participate in Agile/Scrum processes, delivering accurate updates on development progress and addressing challenges. Bachelor’s degree in computer science, Software Engineering, or equivalent. Proven software development experience, demonstrated by a robust portfolio of completed projects highlighting technical expertise. Proficiency in AWS and at least one programming language like Go, Java, Python, or similar. Familiarity with software development tools, frameworks, version control systems, and collaborative development environments. Strong grasp of software development principles, design patterns, and best practices. Effective problem-solving abilities for analyzing complex technical issues and proposing viable solutions. Excellent communication skills, enabling seamless collaboration with cross-functional teams. Adaptability and a readiness to acquire new technologies and programming languages. Experience with Agile methodologies and knowledge of tools like JIRA."},
{"job_title": "Engineering Manager, App Stores Backend", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "This is a technical management role to lead a team that develops Python and Golang micro-services that power our global software distribution engine. The world sees it as the Snap Store and Charmhub.io marketplaces, behind the scenes it is a unified system that understands key concepts in software distribution - architectures, releases, betas, release candidates, stable releases, branches and more. We are expanding the range of software we can deliver through this system, and excited that we can transform the experience that people all over the world have with their open source software. If you have a passion for clean APIs, believe that great engineers ship software calmly and regularly against an agile plan, and know that tests are the key to higher velocity and reliability, you'll fit right in. As an Engineering Manager at Canonical, you must be technically strong, but your main responsibility is to run an effective team and develop the colleagues you manage. You will develop and review code as a leader, but know that the best way to improve the product is to ensure that the whole team is focused, productive and unblocked. You are expected to help them grow as engineers, do meaningful work, do it outstandingly well, find professional and personal satisfaction, and work well with colleagues and the community. You will also be expected to be a positive influence on culture, facilitate technical delivery, and regularly reflect with your team on strategy and execution. You will collaborate closely with other Engineering Managers, product managers, and architects, producing an engineering roadmap with ambitious and achievable goals. We expect Engineering Managers to be fluent in the programming language, architecture, and components that their team uses. Code reviews and architectural leadership are part of the job. The commitment to healthy engineering practices, documentation, quality and performance optimisation is as important, as is the requirement for fair and clear management, and the obligation to ensure a high-performing team. This is a great opportunity to really learn how to do engineering of a highly-scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance). In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world. Lead a remote team of engineers in your time zone Develop talent through coaching, mentoring, feedback, and hands-on career development Set and manage expectations with other engineering teams, management, and external stakeholders Be an active part of the leadership team and collaborate with other leaders in the organisation With your team, build clean web service APIs to support both CLI and web frontend clients, using Python (and optionally Golang). Engage with many other teams at Canonical, as well as the open-source community and commercial partners Good experience of leading modern, agile software development practices Experience of forming a healthy, collaborative engineering culture in line with the company values Demonstrative experience of being a role model for sound engineering principles and directly contribute toward your team's goals Willingness to travel up to 4 times a year for internal events You love to mentor, develop and grow people, and have a track record of doing it You are knowledgeable and passionate about software development You are focused on success and the timely delivery of high-quality software You value and nurture great team culture and spirit You have experience and commitment to agile development methodologies Software development experience in Python (experience in Golang in addition to that would be a big plus) Effective written and verbal communication skills Practical experience with Linux system administration"},
{"job_title": "Software Engineer, Telemetry", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "The right candidate will be part of the team that will provide the backbone to our expanding IoT market, enhancing both our on-prem offering as well as scaling to a global cloud-based platform. Collaborate with a globally distributed team. Write scalable service APIs in Python and Golang to provide telemetry services. Develop observability, remote logging, data acquisition, alert and notification, and edge processing capabilities Work with our infrastructure team to develop both a cloud-based SaaS offering as well as a containerised local on-prem solution. Design and implement new features and enhancements from spec to production at scale. Review code and technical designs produced by other engineers. Discuss ideas and collaborate on finding good solutions. Work remotely with global travel 2 to 4 weeks for internal and external events. You love technology and working with a diverse set of talented people. You are curious, flexible, articulate, and accountable. You value soft skills and are passionate, enterprising, thoughtful, and self-motivated. You have a broad technology base but favor backend code and infrastructure. You have a good understanding of cybersecurity and the challenges of the IoT environment. You have knowledge and experience of telemetry systems including data streaming technologies, observability and monitoring systems, and the application of security/IAM models to such systems. You have proficiency in developing tooling and libraries, and the design and implementation of back-end web services, messaging/data pipelines, and REST APIs using python and/or Golang You are comfortable with Ubuntu as a development and deployment platform. You have a Bachelor's or equivalent in Computer Science, STEM or similar degree."},
{"job_title": "Software Engineering Director", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Even though this is a senior management position, managing managers, we expect Engineering Directors to be outstanding developers with the confidence to lead by example across the full range of activities in their teams. You need to understand what great code looks like in the language and genre of your product - whether that is a web service, or a system daemon, or a desktop application, or a distributed system. You'll need to know how to drive testing and benchmarking to improve the clarity in your teams around quality and performance. You'll also need to be confident to set and defend high expectations of work ethic, consistency, focus and learning. Python and Golang C / C++ / Rust Data infrastructure HTML / CSS / JavaScript / Typescript / React Flutter Distro packaging and systems SAAS and web microservices Kernel Servers Graphics, Browser and Desktop Silicon enablement and embedded devices Product Security Lead multiple teams of engineers, ranging from graduate to senior Develop your engineering managers and maintain Canonical culture Hire staff level engineers for specific roles like performance and quality Coach, mentor, and offer career development feedback Identify and measure indicators of team health and productivity Ensure rounded delivery including community participation and docs Implement disciplined engineering processes and defend them Set and measure progress against benchmark goals for speed and efficiency Represent your product to stakeholders, partners, and customers Develop and evangelise great engineering and organisational practices Plan and manage progress on agreed goals and projects Be an active part of the leadership team, collaborating with other leaders Collaborate with leads for related or dependent products An exceptional academic track record from both high school and university Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path Extensive management experience and confidence to set high expectations Outstanding Linux based software engineering track record Drive and a track record of going above-and-beyond expectations Excellent verbal and written communication skills in English Public speaking and presentation skills A love of developing and growing people and a track record of it Experience in leading, coaching and mentoring software developers Organised and able to ensure your team delivers timely, high quality results Well-organised, self-starting and able to deliver to schedule Professional manner interacting with colleagues, partners, and community You have advanced expertise in your own domain You are knowledgeable and passionate about software development You have solid experience working in an agile development environment You have a demonstrated drive for continual learning Builds trust, relationships and confidence Result-oriented, with a personal drive to meet commitments Ability to travel twice a year, for company events up to two weeks each Experience in a developer advocacy or community role Open source community engagement and leadership Ops and system administration experience Performance engineering and security experience"},
{"job_title": "Software Engineer - App Stores Backend (Remote)", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Collaborate remotely with a globally distributed team. Write clean web service APIs to support both CLI and web frontend clients, using Python (and optionally Golang). Design and implement new features and enhancements from spec to production and ongoing operations at scale. Review code and technical designs produced by other engineers. Discuss ideas and collaborate on finding good solutions. Work remotely with global travel 2 to 4 weeks for internal and external events. You love technology and working with a diverse set of talented people. You are curious, flexible, articulate, and accountable. You value soft skills and are passionate, enterprising, thoughtful, and self-motivated. You have a broad technology base but favor backend code and infrastructure. You have proficiency developing public-facing APIs and web applications, preferably using Python and/or Golang. You know your way around relational and non-relational databases and can effectively design data models that perform well, and tune queries to access them. You are comfortable with Ubuntu as a development and deployment platform. You have a Bachelor's or equivalent in Computer Science, STEM or similar degree."},
{"job_title": "Cloud Field Engineer - EMEA (Remote)", "date_posted": " Oct 24, 2023", "job_type": "Remote", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "This role has very diverse responsibilities. The team members are Linux and cloud solutions architects for our customers, designing private and public cloud solutions fitting their workload needs. They are the cloud consultants who work hands-on with the technologies by deploying, testing and handing over the solution to our support or managed services team at the end of a project. They are also software engineers who use Python to develop Kubernetes operators and Linux open source infrastructure-as-code. The people who love this role are developers who like to solve customer problems through architecture, presentations and training. Work across the entire Linux stack, from kernel, networking, storage, to applications Work in Python to design and deliver open source code Architect cloud infrastructure solutions like OpenStack, Kubernetes, Ceph, Hadoop and Spark either On-Premises or in Public Cloud (AWS, Azure, Google Cloud) Coach and develop your colleagues where you have insights Grow a healthy, collaborative engineering culture in line with the company values Work from the comfort of your home Global travel up to 25% of time for internal and external events University degree in Computer Science or related software engineering expertise You have sound knowledge of cloud computing concepts & technologies, such as Kubernetes, Openstack, AWS, GCP, Azure, Ceph, etc. You have practical knowledge of Linux and networking You have Intermediate to Advanced level of Python programming skills You are a dynamic person who loves to jump in new projects and interact with people You have a demonstrated drive for continual learning Excellent communication and presentation skills (English) You have great organisational skills and follow-up reliably on commitments (Optional) You speak a second language - French, German, Italian, Arabic or Spanish OpenStack and Kubernetes infrastructure Linux Ubuntu and networking knowledge Wide range of open source applications and skills Work directly with customers in a range of different businesses Real-life and hands-on exposure to a wide range of emerging technologies and tools"},
{"job_title": "Software Engineer - Identity Management for Canonical Products", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "As a software engineer for Identity Management products of Canonical, you will modernize and expand the capabilities of the identity management solutions we use for authentication and authorization in our products, as well as our canonical.com and ubuntu.com websites. Your work on Identity Management will directly impact the users of all Canonical products. Technical excellence and a background in software engineering are necessary prerequisites for this role. You will be expected to own the design and delivery of the system, facilitate integrations and work with your team on strategy and execution. Collaborate proactively with a distributed team Write clean web service APIs to support both CLI and web frontend clients, using Python (and optionally Golang). Design and implement new features and enhancements from spec to production and ongoing operations at scale. Review code produced by other engineers Discuss ideas and collaborate on finding good solutions. Create and enhance management, authentication and authorization API endpoints Craft end-user authentication flows from design to implementation Modernize the identity stack of our websites and products by driving adoption of best-of-breed IAM technologies Deliver great products that users love by maintaining a culture of quality and engineering excellence Work from home with global travel 2 to 4 weeks per year for internal and external events You have a Bachelor's or equivalent in Computer Science, STEM or similar degree You are a software engineer, with specific experience building identity and access management products You are familiar with the open source software, standards, protocols and concepts in the identity space (e.g. OpenID, OAuth, LDAP) You have experience implementing authorization frameworks in distributed systems You value secure coding and standards, and enjoy working on teams that do the same You have solid experience working in an agile development environment You love technology and working with a diverse set of talented people. You are comfortable with Ubuntu as a development and deployment platform. You are curious, flexible, articulate, and accountable You value soft skills and are passionate, enterprising, thoughtful, and self-motivated You love embracing new technologies and pushing the boundaries of what is possible, with a view to building products that improve how people operate software and infrastructure everywhere"},
{"job_title": "Software Engineer - SaaS (launchpad.net)", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Proactively collaborate within and contribute to design, architecture, and feature-selection for solutions across distributed teams Write high-quality, API-first Python code with unit tests Debug issues and produce high-quality fixes Review code produced by other engineers Work from home with global travel 2 to 4 times a year for internal and external events You love technology, working with brilliant people, and solving interesting problems You are a strategic thinker You are curious, flexible, articulate, and accountable You value soft skills and are passionate, enterprising, thoughtful, and self-motivated You have a Bachelor's or equivalent in Computer Science, STEM or similar degree You have proficiency delivering robust code to production, preferably written in Python. You have experience and enjoy maintaining and improving large and mature web applications. You have experience with databases, ORMs (PostgreSQL a plus), data management, and data modelling. You have an interest in, or experience with, integration, infrastructure and operations. You believe that robust security requires conscious efforts at every stage of delivery. You have familiarity with Ubuntu as a development and deployment platform. You have a solid understanding of the structure of various software packaging systems, including Debian/Ubuntu packages."},
{"job_title": "Python Engineer", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "&nbsp", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Write high-quality, well-designed and well-tested Python software Collaborate proactively with a globally distributed team Display technical leadership at Canonical and in our communities Debug issues and produce high-quality code to fix them Contribute to technical documentation with the aim to make it the best of its kind Work from home with global travel twice a year for company events An exceptional academic track record from both high school and university Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path Drive and a track record of going above-and-beyond expectations Well-organised, self-starting and able to deliver to schedule Professional manner interacting with colleagues, partners, and community Experience writing thoroughly designed, modern, maintainable Python Conscientiousness and detail orientation, with a focus on performance Professional written and spoken English Experience with Linux (Debian or Ubuntu preferred) Excellent interpersonal skills, curiosity, flexibility, and accountability Passion, thoughtfulness, and self-motivation Excellent communication and presentation skills Result-oriented, with a personal drive to meet commitments Ability to travel twice a year, for company events up to two weeks each Experience with container technologies such as LXD, Docker and Kubernetes Understanding of build systems and toolchains, including for cross-compilation Additional languages, particularly Golang or Rust, C or C++ Deep quality and test engineering Web or Flutter front-end experience REST and gRPC API experience SQL and NoSQL data store expertise Experience with public clouds or OpenStack Experience with Debian/Ubuntu packaging Experience with systems programming or scalable web services Performance engineering and security experience"},
{"job_title": "Full Stack Developer", "date_posted": " Oct 24, 2023", "job_type": "Full Time", "qualification": "BA/BSc/HND", "experience": "2 years", "location": "Nairobi", "job_field": "ICT / Computer", "full_description": "Design, develop, and maintain web applications and platforms. Collaborate with the UI/UX team to implement designs and user interfaces. Ensure the responsiveness and performance of applications. Troubleshoot, debug, and optimize code. Stay up-to-date with emerging technologies and best practices. Contribute to the planning and execution of development projects. Bachelor's degree in Computer Science or a related field. Minimum of 2 years of experience as a Full Stack Developer. Strong proficiency in front-end technologies such as HTML, CSS, and JavaScript. Experience with popular JavaScript libraries and frameworks (e.g., React, Angular, Vue.js). Proficiency in back-end technologies such as Node.js, Python, or Ruby on Rails. Solid understanding of database management systems (e.g., SQL, NoSQL). Experience with version control systems (e.g., Git). Excellent problem-solving and communication skills. A link to your portfolio showcasing recent work is required."}
]